app/Controllers/Usuarios.php

SELECT `id`, `nombre`, `password`
FROM `usuarios`
WHERE `nombre` = 'capibara'
AND `password` = '123'
---
    public function check(){




        $email = $this->request->getPost('email');
        $password=$this->request->getPost('pass');
        $modelo= model(UsuariosModel::class);
        $modelo->select('id,nombre, password');
        // $modelo->select('nombre , dni');
        // $articulo = $modelo->find();
        // print_r($articulo);
        // echo $email;
        $modelo->where('nombre', $email);
        $modelo->where('password', $password);

        $resultado = $modelo->find();